### 데이터 수집

* 기상자료개방포털 
    * https://data.kma.go.kr 
    * 회원가입/로그인 필요<br>

>* 기상자료개방포털 > 데이터 > 기상관측 > 지상 > 종관기상관측(ASOS) 
>    * https://data.kma.go.kr/data/grnd/selectAsosRltmList.do?pgmNo=36 
>    * [ 자료형태 ] 일자료 
>    * [ 지점 ] 전체 
>    * [ 자료 ] 기온>최저,최고,평균 
>    * [ 기간 ] 10년단위로 나누어 다운로드

In [1]:
import pandas as pd

### 기상 데이터프레임 생성

* 여러 데이터파일을 연결하여 하나의 데이터프레임 생성
* 데이터 파일 리스트 생성
    * `import glob`
    * `glob.glob(파일경로규칙)`

In [6]:
# ---------------------------
# 데이터 파일 리스트 생성
# ---------------------------

import glob

# data/폴더에서 '기상데이터'가 파일명에 포함된 모든 csv 파일
# 파일명 앞에는 한글자 이상의 다른 글자가 포함되어야 함

files = glob.glob("data/기상데이터/*기상데이터.csv")
files

['data/기상데이터\\1907-1909 기상데이터.csv',
 'data/기상데이터\\1910-1919 기상데이터.csv',
 'data/기상데이터\\1920-1929 기상데이터.csv',
 'data/기상데이터\\1930-1939 기상데이터.csv',
 'data/기상데이터\\1940-1949 기상데이터.csv',
 'data/기상데이터\\1950-1959 기상데이터.csv',
 'data/기상데이터\\1960-1969 기상데이터.csv',
 'data/기상데이터\\1970-1979 기상데이터.csv',
 'data/기상데이터\\1980-1989 기상데이터.csv',
 'data/기상데이터\\1990-1999 기상데이터.csv',
 'data/기상데이터\\2000-2009 기상데이터.csv',
 'data/기상데이터\\2010-2019 기상데이터.csv',
 'data/기상데이터\\2020- 기상데이터.csv']

In [10]:
# ---------------------------
# 데이터프레임 리스트 생성
# ---------------------------
temp = pd.read_csv('data/기상데이터/1907-1909 기상데이터.csv', encoding='cp949', parse_dates=['일시'])
df_list = []
for file in files:
    df = pd.read_csv(file, encoding='cp949', parse_dates=['일시'])
    df_list.append(df)

[       지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0     108  서울 1907-10-01      13.5       7.9      20.7            NaN
 1     108  서울 1907-10-02      16.2       7.9      22.0            NaN
 2     108  서울 1907-10-03      16.2      13.1      21.3            NaN
 3     108  서울 1907-10-04      16.5      11.2      22.0            NaN
 4     108  서울 1907-10-05      17.6      10.9      25.4            NaN
 ...   ...  ..        ...       ...       ...       ...            ...
 7210  165  목포 1909-12-27       2.4      -4.0       8.3            NaN
 7211  165  목포 1909-12-28       6.2       3.4       8.5            NaN
 7212  165  목포 1909-12-29       9.0       6.6      12.4            NaN
 7213  165  목포 1909-12-30       9.8       5.6      11.8            NaN
 7214  165  목포 1909-12-31      10.1       5.9      13.6            NaN

       일강수량(mm)
 0          NaN
 1          0.2
 2          2.4
 3          NaN
 4          NaN
 ...        ...
 7210       NaN
 7211       5.5
 7212       1.1
 7213       0.3
 7214      11.4

 [7215 rows x 8 columns],
         지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0      105  강릉 1911-10-04       NaN      12.2      26.2            NaN
 1      105  강릉 1911-10-09       NaN       6.0      16.6            NaN
 2      105  강릉 1911-10-16       NaN       9.2      15.5            NaN
 3      105  강릉 1911-11-01       NaN       6.0      14.8            NaN
 4      105  강릉 1911-11-04       NaN      10.2      19.5            NaN
 ...    ...  ..        ...       ...       ...       ...            ...
 21565  165  목포 1919-12-27       4.9       1.9       7.5            NaN
 21566  165  목포 1919-12-28      -0.5      -3.5       7.9            NaN
 21567  165  목포 1919-12-29      -2.1      -3.0       1.1            NaN
 21568  165  목포 1919-12-30      -1.5      -5.3       2.9            NaN
 21569  165  목포 1919-12-31       2.4      -2.8       5.4            NaN

        일강수량(mm)
 0           NaN
 1           NaN
 2          36.5
 3           NaN
 4           NaN
 ...         ...
 21565      11.6
 21566       4.0
 21567       3.4
 21568       0.3
 21569       NaN

 [21570 rows x 8 columns],
         지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0      105  강릉 1920-01-01      -3.6      -5.9       1.9            NaN
 1      105  강릉 1920-01-02      -0.5      -6.7       5.2            NaN
 2      105  강릉 1920-01-03      -3.1      -7.2       0.6            NaN
 3      105  강릉 1920-01-04      -5.6     -10.5      -0.2            NaN
 4      105  강릉 1920-01-05      -2.2      -8.4       4.8            NaN
 ...    ...  ..        ...       ...       ...       ...            ...
 28003  184  제주 1929-12-27      10.7      10.0      13.7            NaN
 28004  184  제주 1929-12-28       9.7       8.1      10.8            NaN
 28005  184  제주 1929-12-29      10.5       9.1      11.6            NaN
 28006  184  제주 1929-12-30       9.0       7.9      10.8            NaN
 28007  184  제주 1929-12-31       7.0       4.3       9.4            NaN

        일강수량(mm)
 0           NaN
 1           NaN
 2           0.6
 3           NaN
 4           NaN
 ...         ...
 28003      17.6
 28004      37.6
 28005       2.3
 28006      13.9
 28007       NaN

 [28008 rows x 8 columns],
         지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0      105  강릉 1930-01-01      -0.1      -3.7       5.7            NaN
 1      105  강릉 1930-01-02       1.5      -2.4       4.9            NaN
 2      105  강릉 1930-01-03       1.0      -1.4       4.2            NaN
 3      105  강릉 1930-01-04      -5.1      -9.4      -0.7            NaN
 4      105  강릉 1930-01-05      -8.7     -11.0      -5.8            NaN
 ...    ...  ..        ...       ...       ...       ...            ...
 29972  184  제주 1939-12-27       9.1       7.8      11.7            NaN
 29973  184  제주 1939-12-28       8.3       7.1      10.5            NaN
 29974  184  제주 1939-12-29       7.1       6.4       9.0            0.1
 29975  184  제주 1939-12-30       8.7       6.4      10.6            NaN
 29976  184  제주 1939-12-31      10.5       8.2      13.6            NaN

        일강수량(mm)
 0           NaN
 1           1.1
 2          13.4
 3           NaN
 4           NaN
 ...         ...
 29972       NaN
 29973       NaN
 29974       0.0
 29975       NaN
 29976       NaN

 [29977 rows x 8 columns],
         지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0      105  강릉 1940-01-01      -1.4      -4.7       3.7            NaN
 1      105  강릉 1940-01-02       3.5      -1.1       9.0            NaN
 2      105  강릉 1940-01-03      -1.0      -3.3       3.4            NaN
 3      105  강릉 1940-01-04       5.0      -4.9      11.2            NaN
 4      105  강릉 1940-01-05       6.0      -2.2      12.1            NaN
 ...    ...  ..        ...       ...       ...       ...            ...
 41723  184  제주 1949-12-27       6.8       4.8       8.9            2.3
 41724  184  제주 1949-12-28       5.9       3.4       9.2            0.0
 41725  184  제주 1949-12-29       4.7       2.9       6.7            0.2
 41726  184  제주 1949-12-30       6.9       4.2      10.4            2.6
 41727  184  제주 1949-12-31      12.1      10.1      13.4            5.2

        일강수량(mm)
 0           NaN
 1           0.0
 2           0.3
 3           0.0
 4           NaN
 ...         ...
 41723       3.8
 41724       0.0
 41725       0.2
 41726      13.1
 41727      25.6

 [41728 rows x 8 columns],
         지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0      105  강릉 1950-01-01       2.0      -0.3       4.5            NaN
 1      105  강릉 1950-01-02       3.9      -1.0       8.4            NaN
 2      105  강릉 1950-01-03       0.6      -4.1       3.7            NaN
 3      105  강릉 1950-01-04      -3.4      -6.9      -0.1            NaN
 4      105  강릉 1950-01-05      -1.6      -7.9       3.5            NaN
 ...    ...  ..        ...       ...       ...       ...            ...
 48240  184  제주 1959-12-27       8.4       5.3      11.0            NaN
 48241  184  제주 1959-12-28       7.4       2.0      11.2            NaN
 48242  184  제주 1959-12-29       5.9       1.6       9.9            NaN
 48243  184  제주 1959-12-30       8.7       1.8      12.0            3.0
 48244  184  제주 1959-12-31       8.1       7.4      13.1            7.3

        일강수량(mm)
 0           8.4
 1           NaN
 2           NaN
 3           NaN
 4           0.0
 ...         ...
 48240       NaN
 48241       NaN
 48242       NaN
 48243       7.0
 48244      25.3

 [48245 rows x 8 columns],
         지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0       90  속초 1968-01-01      -1.4      -4.8       2.5            NaN
 1       90  속초 1968-01-02       2.6      -1.9       6.1            0.0
 2       90  속초 1968-01-03      -0.5      -3.3       3.6            NaN
 3       90  속초 1968-01-04       3.1      -1.5       7.2            NaN
 4       90  속초 1968-01-05       6.1       1.5      11.4            NaN
 ...    ...  ..        ...       ...       ...       ...            ...
 62767  192  진주 1969-12-27      -3.3      -6.6       1.1            NaN
 62768  192  진주 1969-12-28      -1.7      -7.7       2.9            NaN
 62769  192  진주 1969-12-29      -1.1      -5.7       5.9            NaN
 62770  192  진주 1969-12-30      -0.6      -3.2       2.2            NaN
 62771  192  진주 1969-12-31      -1.5      -5.9       4.0            NaN

        일강수량(mm)
 0           NaN
 1           0.0
 2           NaN
 3           NaN
 4           NaN
 ...         ...
 62767       NaN
 62768       NaN
 62769       NaN
 62770       2.8
 62771       NaN

 [62772 rows x 8 columns],
          지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0        90  속초 1970-01-01       2.9      -0.2       6.0            NaN
 1        90  속초 1970-01-02       1.4      -0.1       4.7            NaN
 2        90  속초 1970-01-03      -1.3      -3.4       0.0            NaN
 3        90  속초 1970-01-04      -6.8     -11.6      -3.3            NaN
 4        90  속초 1970-01-05      -9.0     -15.6      -2.6            NaN
 ...     ...  ..        ...       ...       ...       ...            ...
 195875  295  남해 1979-12-27       2.4      -1.4       6.6            NaN
 195876  295  남해 1979-12-28      -0.1      -3.4       5.2            NaN
 195877  295  남해 1979-12-29       1.4      -3.3       8.7            NaN
 195878  295  남해 1979-12-30       3.3      -3.3      10.2            NaN
 195879  295  남해 1979-12-31       7.5       3.5      11.6            NaN

         일강수량(mm)
 0            NaN
 1            NaN
 2            7.1
 3           10.7
 4            NaN
 ...          ...
 195875       NaN
 195876       NaN
 195877       NaN
 195878       0.8
 195879       3.3

 [195880 rows x 8 columns],
          지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0        90  속초 1980-01-01       3.2       0.6       6.0            NaN
 1        90  속초 1980-01-02       5.5       4.0       7.8            NaN
 2        90  속초 1980-01-03       6.8       3.9      11.1            NaN
 3        90  속초 1980-01-04       2.7      -1.3       5.3            NaN
 4        90  속초 1980-01-05      -1.0      -5.0       3.2            NaN
 ...     ...  ..        ...       ...       ...       ...            ...
 244900  295  남해 1989-12-27      -0.2      -4.5       7.1            NaN
 244901  295  남해 1989-12-28      -0.9      -5.9       5.8            NaN
 244902  295  남해 1989-12-29       3.1       0.6      10.2            NaN
 244903  295  남해 1989-12-30       1.7      -1.2       5.9            NaN
 244904  295  남해 1989-12-31       0.4      -5.3       8.2            NaN

         일강수량(mm)
 0            2.3
 1            6.9
 2            NaN
 3            5.3
 4            NaN
 ...          ...
 244900       NaN
 244901       NaN
 244902       NaN
 244903       NaN
 244904       NaN

 [244905 rows x 8 columns],
          지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0        90  속초 1990-01-01       0.0      -2.9       3.9            NaN
 1        90  속초 1990-01-02      -1.3      -4.7       2.8            NaN
 2        90  속초 1990-01-03      -2.8      -5.6       1.8            NaN
 3        90  속초 1990-01-04      -1.1      -6.5       5.5            NaN
 4        90  속초 1990-01-05       3.8      -0.1       6.3            NaN
 ...     ...  ..        ...       ...       ...       ...            ...
 267199  295  남해 1999-12-27       2.2      -3.9      11.2            NaN
 267200  295  남해 1999-12-28       5.7      -2.6      13.1            NaN
 267201  295  남해 1999-12-29       4.2      -1.4       9.8            NaN
 267202  295  남해 1999-12-30       3.3      -2.7      10.5            NaN
 267203  295  남해 1999-12-31       5.2      -1.8      11.7            NaN

         일강수량(mm)
 0            NaN
 1            NaN
 2            NaN
 3            NaN
 4            NaN
 ...          ...
 267199       NaN
 267200       NaN
 267201       NaN
 267202       NaN
 267203       NaN

 [267204 rows x 8 columns],
          지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0        90  속초 2000-01-01       3.2       2.4       4.1            NaN
 1        90  속초 2000-01-02       5.3       2.4       8.8            NaN
 2        90  속초 2000-01-03       1.8      -2.7       6.0            NaN
 3        90  속초 2000-01-04       1.0      -2.7       5.5            NaN
 4        90  속초 2000-01-05       0.9      -0.1       1.7            NaN
 ...     ...  ..        ...       ...       ...       ...            ...
 285451  295  남해 2009-12-27       0.7      -3.5       6.4            NaN
 285452  295  남해 2009-12-28      -0.2      -3.5       4.5            NaN
 285453  295  남해 2009-12-29       0.4      -5.2       5.1            NaN
 285454  295  남해 2009-12-30       2.9      -1.7       7.3            NaN
 285455  295  남해 2009-12-31      -2.9      -5.9      -1.1            NaN

         일강수량(mm)
 0            1.2
 1            1.1
 2            NaN
 3            NaN
 4           10.4
 ...          ...
 285451       NaN
 285452       NaN
 285453       NaN
 285454       NaN
 285455       0.0

 [285456 rows x 8 columns],
          지점 지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0        90  속초 2010-01-01      -3.1      -8.8       0.3            NaN
 1        90  속초 2010-01-02      -0.4      -2.5       3.7            NaN
 2        90  속초 2010-01-03      -2.8      -6.4       1.8            NaN
 3        90  속초 2010-01-04      -2.3      -5.6       0.2            NaN
 4        90  속초 2010-01-05      -4.6      -7.8       0.0            NaN
 ...     ...  ..        ...       ...       ...       ...            ...
 340004  295  남해 2019-12-27       3.3      -1.9       7.4            NaN
 340005  295  남해 2019-12-28       2.2      -1.9       8.1            NaN
 340006  295  남해 2019-12-29       3.2      -0.5       5.8            NaN
 340007  295  남해 2019-12-30       6.8       3.6      12.6            NaN
 340008  295  남해 2019-12-31      -0.6      -4.7       3.5            NaN

         일강수량(mm)
 0            NaN
 1            4.0
 2            NaN
 3           10.5
 4            0.0
 ...          ...
 340004       NaN
 340005       NaN
 340006       8.5
 340007       0.5
 340008       NaN

 [340009 rows x 8 columns],
          지점  지점명         일시  평균기온(°C)  최저기온(°C)  최고기온(°C)  1시간 최다강수량(mm)  \
 0        90   속초 2020-01-01       0.8      -3.4       4.8            NaN
 1        90   속초 2020-01-02       2.8      -2.1       6.6            NaN
 2        90   속초 2020-01-03       4.7       0.8       8.5            NaN
 3        90   속초 2020-01-04       4.0       1.1       8.1            NaN
 4        90   속초 2020-01-05       3.1      -0.6       8.8            NaN
 ...     ...  ...        ...       ...       ...       ...            ...
 183538  296  북부산 2025-03-27      16.9      14.8      19.2            NaN
 183539  296  북부산 2025-03-28      12.1       8.0      16.5            NaN
 183540  296  북부산 2025-03-29       7.7       1.6      12.7            NaN
 183541  296  북부산 2025-03-30       5.3       1.4      11.0            NaN
 183542  296  북부산 2025-03-31       6.5      -1.5      13.8            NaN

         일강수량(mm)
 0            NaN
 1            NaN
 2            NaN
 3            NaN
 4            NaN
 ...          ...
 183538       0.5
 183539       0.5
 183540       NaN
 183541       NaN
 183542       NaN

 [183543 rows x 8 columns]]

In [16]:
# ---------------------------
# 데이터프레임 리스트의 길이 확인
# ---------------------------
len(df_list)


# ---------------------------
# 데이터프레임 리스트의 개별 데이터프레임 확인
# ---------------------------
df_list[4]

,지점,지점명,일시,평균기온(°C),최저기온(°C),최고기온(°C),1시간 최다강수량(mm),일강수량(mm)
0,105,강릉,1940-01-01,-1.4,-4.7,3.7,NaN,NaN
1,105,강릉,1940-01-02,3.5,-1.1,9.0,NaN,0.0
2,105,강릉,1940-01-03,-1.0,-3.3,3.4,NaN,0.3
3,105,강릉,1940-01-04,5.0,-4.9,11.2,NaN,0.0
4,105,강릉,1940-01-05,6.0,-2.2,12.1,NaN,NaN
...,...,...,...,...,...,...,...,...
41723,184,제주,1949-12-27,6.8,4.8,8.9,2.3,3.8
41724,184,제주,1949-12-28,5.9,3.4,9.2,0.0,0.0
41725,184,제주,1949-12-29,4.7,2.9,6.7,0.2,0.2
41726,184,제주,1949-12-30,6.9,4.2,10.4,2.6,13.1
41727,184,제주,1949-12-31,12.1,10.1,13.4,5.2,25.6

In [25]:
# ---------------------------
# 데이터프레임 연결
#   df_all
# ---------------------------
df_all = pd.concat(df_list, ignore_index=True)

In [30]:
# ---------------------------
# 연결한 데이터프레임 shape 확인
# ---------------------------

df_all.shape

# ---------------------------
# 연결한 데이터프레임 head, tail 확인
# ---------------------------
df_all.head()
df_all.tail()

,지점,지점명,일시,평균기온(°C),최저기온(°C),최고기온(°C),1시간 최다강수량(mm),일강수량(mm)
1756507,296,북부산,2025-03-27,16.9,14.8,19.2,NaN,0.5
1756508,296,북부산,2025-03-28,12.1,8.0,16.5,NaN,0.5
1756509,296,북부산,2025-03-29,7.7,1.6,12.7,NaN,NaN
1756510,296,북부산,2025-03-30,5.3,1.4,11.0,NaN,NaN
1756511,296,북부산,2025-03-31,6.5,-1.5,13.8,NaN,NaN

In [31]:
# ---------------------------
# info()
# ---------------------------
df_all.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1756512 entries, 0 to 1756511
Data columns (total 8 columns):
 #   Column         Dtype
---  ------         -----
 0   지점             int64
 1   지점명            object
 2   일시             datetime64[ns]
 3   평균기온(°C)       float64
 4   최저기온(°C)       float64
 5   최고기온(°C)       float64
 6   1시간 최다강수량(mm)  float64
 7   일강수량(mm)       float64
dtypes: datetime64[ns](1), float64(5), int64(1), object(1)
memory usage: 107.2+ MB

In [34]:
# ---------------------------
# 결측치 확인
# ---------------------------
df_all.isnull().sum()

지점                     0
지점명                    0
일시                     0
평균기온(°C)            4364
최저기온(°C)            2167
최고기온(°C)            2114
1시간 최다강수량(mm)    1346282
일강수량(mm)         1098472
dtype: int64

In [37]:
# ---------------------------
# 연도, 월 컬럼 추가
# ---------------------------
df_all['연도'] = df_all['일시'].dt.year
df_all['월'] = df_all['일시'].dt.month

,지점,지점명,일시,평균기온(°C),최저기온(°C),최고기온(°C),1시간 최다강수량(mm),일강수량(mm),연도,월
0,108,서울,1907-10-01,13.5,7.9,20.7,NaN,NaN,1907,10
1,108,서울,1907-10-02,16.2,7.9,22.0,NaN,0.2,1907,10
2,108,서울,1907-10-03,16.2,13.1,21.3,NaN,2.4,1907,10
3,108,서울,1907-10-04,16.5,11.2,22.0,NaN,NaN,1907,10
4,108,서울,1907-10-05,17.6,10.9,25.4,NaN,NaN,1907,10

In [38]:
df_all.head()

,지점,지점명,일시,평균기온(°C),최저기온(°C),최고기온(°C),1시간 최다강수량(mm),일강수량(mm),연도,월
0,108,서울,1907-10-01,13.5,7.9,20.7,NaN,NaN,1907,10
1,108,서울,1907-10-02,16.2,7.9,22.0,NaN,0.2,1907,10
2,108,서울,1907-10-03,16.2,13.1,21.3,NaN,2.4,1907,10
3,108,서울,1907-10-04,16.5,11.2,22.0,NaN,NaN,1907,10
4,108,서울,1907-10-05,17.6,10.9,25.4,NaN,NaN,1907,10

### 지점정보 데이터프레임 생성
* 지점, 지점명, 데이터수, 시작년도, 끝년도

In [54]:
# --------------------
# 지점별 데이터 수
#   df_location_cnt
# --------------------

# df_location_cnt = df_all.value_counts('지점명')
df_all.groupby('지점명').size().sort_values(ascending=False)

지점명
부산       44187
인천       43698
목포       43585
대구       42810
서울       41936
         ...
관악산       2738
세종        2130
북부산        811
서청주        701
대구(기)      619
Length: 104, dtype: int64

In [59]:
# --------------------
# 지점별 데이터 수
#   df_location_cnt
# --------------------

df_location_cnt = df_all.value_counts(['지점','지점명']).to_frame()
df_location_cnt.columns = ["데이터수"]
df_location_cnt

            데이터수
지점  지점명
159 부산     44187
112 인천     43698
165 목포     43585
143 대구     42810
108 서울     41936
...          ...
116 관악산     2738
239 세종      2130
296 북부산      811
181 서청주      701
176 대구(기)    619

[105 rows x 1 columns]

In [69]:
# -------------------------
# 지점별 시작년도, 끝년도
#   df_location_year
# -------------------------
df_location_year = df_all.groupby(['지점', '지점명']).agg({'연도':['min', 'max']})
df_location_year.columns = ['시작년도', '끝년도']
df_location_year

         시작년도   끝년도
지점  지점명
90  속초   1968  2025
93  북춘천  2016  2025
95  철원   1988  2025
98  동두천  1998  2025
99  파주   2002  2025
...       ...   ...
288 밀양   1973  2025
289 산청   1972  2025
294 거제   1972  2025
295 남해   1972  2025
296 북부산  2023  2025

[105 rows x 2 columns]

In [73]:
# -------------------------
# 지점별 데이터 수, 시작년도, 끝년도 concat
#   df_location
# -------------------------
df_location = pd.concat([df_location_cnt, df_location_year], axis=1).reset_index()
df_location

      지점    지점명   데이터수  시작년도   끝년도
0    159     부산  44187  1904  2025
1    112     인천  43698  1904  2025
2    165     목포  43585  1904  2025
3    143     대구  42810  1907  2025
4    108     서울  41936  1907  2025
..   ...    ...    ...   ...   ...
100  116    관악산   2738  1983  1990
101  239     세종   2130  2019  2025
102  296    북부산    811  2023  2025
103  181    서청주    701  2023  2025
104  176  대구(기)    619  2013  2015

[105 rows x 5 columns]

### 데이터프레임을 파일로 다운로드

#### 기상데이터

In [ ]:
# --------------------
# 파일로 다운로드
#   기상데이터_전체.csv
# --------------------

file_path = 'data/기상데이터/기상데이터_전체.csv'
df_all.to_csv(file_path, index=False)

In [77]:
# --------------------
# 파일을 다시 열어서 확인
# --------------------
pd.read_csv(file_path)

,지점,지점명,일시,평균기온(°C),최저기온(°C),최고기온(°C),1시간 최다강수량(mm),일강수량(mm),연도,월
0,108,서울,1907-10-01,13.5,7.9,20.7,NaN,NaN,1907,10
1,108,서울,1907-10-02,16.2,7.9,22.0,NaN,0.2,1907,10
2,108,서울,1907-10-03,16.2,13.1,21.3,NaN,2.4,1907,10
3,108,서울,1907-10-04,16.5,11.2,22.0,NaN,NaN,1907,10
4,108,서울,1907-10-05,17.6,10.9,25.4,NaN,NaN,1907,10
...,...,...,...,...,...,...,...,...,...,...
1756507,296,북부산,2025-03-27,16.9,14.8,19.2,NaN,0.5,2025,3
1756508,296,북부산,2025-03-28,12.1,8.0,16.5,NaN,0.5,2025,3
1756509,296,북부산,2025-03-29,7.7,1.6,12.7,NaN,NaN,2025,3
1756510,296,북부산,2025-03-30,5.3,1.4,11.0,NaN,NaN,2025,3
1756511,296,북부산,2025-03-31,6.5,-1.5,13.8,NaN,NaN,2025,3

#### 지점정보

In [ ]:
# --------------------
# 파일로 다운로드
#   기상데이터_지점정보.csv
# --------------------
file_path = 'data/기상데이터/기상데이터_지점정보.csv'
df_location.to_csv(file_path, index=False)

In [80]:
# --------------------
# 파일을 다시 열어서 확인
# --------------------
pd.read_csv(file_path)

      지점    지점명   데이터수  시작년도   끝년도
0    159     부산  44187  1904  2025
1    112     인천  43698  1904  2025
2    165     목포  43585  1904  2025
3    143     대구  42810  1907  2025
4    108     서울  41936  1907  2025
..   ...    ...    ...   ...   ...
100  116    관악산   2738  1983  1990
101  239     세종   2130  2019  2025
102  296    북부산    811  2023  2025
103  181    서청주    701  2023  2025
104  176  대구(기)    619  2013  2015

[105 rows x 5 columns]